
{
    "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
    "description": "Device restriction baseline for Windows 10 devices",
    "displayName": "Win10 - Device restrictions - Baseline",
    "enableAutomaticRedeployment": true,
    "assignedAccessSingleModeUserName": null,
    "assignedAccessSingleModeAppUserModelId": null,
    "microsoftAccountSignInAssistantSettings": "notConfigured",
    "authenticationAllowSecondaryDevice": true,
    "authenticationAllowFIDODevice": false,
    "cryptographyAllowFipsAlgorithmPolicy": false,
    "displayAppListWithGdiDPIScalingTurnedOn": [],
    "displayAppListWithGdiDPIScalingTurnedOff": [],
    "enterpriseCloudPrintDiscoveryEndPoint": null,
    "enterpriseCloudPrintOAuthAuthority": null,
    "enterpriseCloudPrintOAuthClientIdentifier": null,
    "enterpriseCloudPrintResourceIdentifier": null,
    "enterpriseCloudPrintDiscoveryMaxLimit": null,
    "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
    "messagingBlockSync": false,
    "messagingBlockMMS": false,
    "messagingBlockRichCommunicationServices": false,
    "searchBlockDiacritics": false,
    "searchDisableAutoLanguageDetection": false,
    "searchDisableIndexingEncryptedItems": false,
    "searchEnableRemoteQueries": false,
    "searchDisableUseLocation": false,
    "searchDisableIndexerBackoff": false,
    "searchDisableIndexingRemovableDrive": false,
    "searchEnableAutomaticIndexSizeManangement": false,
    "securityBlockAzureADJoinedDevicesAutoEncryption": false,
    "diagnosticsDataSubmissionMode": "userDefined",
    "oneDriveDisableFileSync": false,
    "systemTelemetryProxyServer": null,
    "inkWorkspaceAccess": "enabled",
    "inkWorkspaceBlockSuggestedApps": false,
    "smartScreenEnableAppInstallControl": false,
    "personalizationDesktopImageUrl": null,
    "personalizationLockScreenImageUrl": null,
    "bluetoothAllowedServices": [],
    "bluetoothBlockAdvertising": false,
    "bluetoothBlockDiscoverableMode": false,
    "bluetoothBlockPrePairing": false,
    "edgeBlockAutofill": false,
    "edgeBlocked": false,
    "edgeCookiePolicy": "userDefined",
    "edgeBlockDeveloperTools": false,
    "edgeBlockSendingDoNotTrackHeader": true,
    "edgeBlockExtensions": false,
    "edgeBlockInPrivateBrowsing": false,
    "edgeBlockJavaScript": false,
    "edgeBlockPasswordManager": false,
    "edgeBlockAddressBarDropdown": false,
    "edgeBlockCompatibilityList": false,
    "edgeClearBrowsingDataOnExit": false,
    "edgeAllowStartPagesModification": false,
    "edgeDisableFirstRunPage": false,
    "edgeBlockLiveTileDataCollection": false,
    "edgeSyncFavoritesWithInternetExplorer": false,
    "cellularBlockDataWhenRoaming": false,
    "cellularBlockVpn": false,
    "cellularBlockVpnWhenRoaming": false,
    "cellularData": "allowed",
    "defenderBlockEndUserAccess": false,
    "defenderDaysBeforeDeletingQuarantinedMalware": null,
    "defenderDetectedMalwareActions": null,
    "defenderSystemScanSchedule": "userDefined",
    "defenderFilesAndFoldersToExclude": [],
    "defenderFileExtensionsToExclude": [],
    "defenderScanMaxCpu": null,
    "defenderMonitorFileActivity": "monitorAllFiles",
    "defenderPotentiallyUnwantedAppAction": "audit",
    "defenderProcessesToExclude": [],
    "defenderPromptForSampleSubmission": "promptBeforeSendingPersonalData",
    "defenderRequireBehaviorMonitoring": true,
    "defenderRequireCloudProtection": true,
    "defenderRequireNetworkInspectionSystem": true,
    "defenderRequireRealTimeMonitoring": true,
    "defenderScanArchiveFiles": true,
    "defenderScanDownloads": true,
    "defenderScanNetworkFiles": true,
    "defenderScanIncomingMail": true,
    "defenderScanMappedNetworkDrivesDuringFullScan": false,
    "defenderScanRemovableDrivesDuringFullScan": true,
    "defenderScanScriptsLoadedInInternetExplorer": true,
    "defenderSignatureUpdateIntervalInHours": 4,
    "defenderScanType": "userDefined",
    "defenderScheduledScanTime": null,
    "defenderScheduledQuickScanTime": null,
    "defenderCloudBlockLevel": "notConfigured",
    "defenderCloudExtendedTimeout": null,
    "lockScreenAllowTimeoutConfiguration": false,
    "lockScreenBlockActionCenterNotifications": false,
    "lockScreenBlockCortana": true,
    "lockScreenBlockToastNotifications": true,
    "lockScreenTimeoutInSeconds": null,
    "passwordBlockSimple": true,
    "passwordExpirationDays": null,
    "passwordMinimumLength": 8,
    "passwordMinutesOfInactivityBeforeScreenTimeout": 5,
    "passwordMinimumCharacterSetCount": 2,
    "passwordPreviousPasswordBlockCount": null,
    "passwordRequired": true,
    "passwordRequireWhenResumeFromIdleState": false,
    "passwordRequiredType": "alphanumeric",
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "privacyAdvertisingId": "notConfigured",
    "privacyAutoAcceptPairingAndConsentPrompts": false,
    "privacyBlockInputPersonalization": false,
    "startBlockUnpinningAppsFromTaskbar": false,
    "startMenuAppListVisibility": "userDefined",
    "startMenuHideChangeAccountSettings": false,
    "startMenuHideFrequentlyUsedApps": false,
    "startMenuHideHibernate": false,
    "startMenuHideLock": false,
    "startMenuHidePowerButton": false,
    "startMenuHideRecentJumpLists": false,
    "startMenuHideRecentlyAddedApps": false,
    "startMenuHideRestartOptions": false,
    "startMenuHideShutDown": false,
    "startMenuHideSignOut": false,
    "startMenuHideSleep": false,
    "startMenuHideSwitchAccount": false,
    "startMenuHideUserTile": false,
    "startMenuLayoutEdgeAssetsXml": null,
    "startMenuLayoutXml": null,
    "startMenuMode": "userDefined",
    "startMenuPinnedFolderDocuments": "notConfigured",
    "startMenuPinnedFolderDownloads": "notConfigured",
    "startMenuPinnedFolderFileExplorer": "notConfigured",
    "startMenuPinnedFolderHomeGroup": "notConfigured",
    "startMenuPinnedFolderMusic": "notConfigured",
    "startMenuPinnedFolderNetwork": "notConfigured",
    "startMenuPinnedFolderPersonalFolder": "notConfigured",
    "startMenuPinnedFolderPictures": "notConfigured",
    "startMenuPinnedFolderSettings": "notConfigured",
    "startMenuPinnedFolderVideos": "notConfigured",
    "settingsBlockSettingsApp": false,
    "settingsBlockSystemPage": false,
    "settingsBlockDevicesPage": false,
    "settingsBlockNetworkInternetPage": false,
    "settingsBlockPersonalizationPage": false,
    "settingsBlockAccountsPage": false,
    "settingsBlockTimeLanguagePage": false,
    "settingsBlockEaseOfAccessPage": false,
    "settingsBlockPrivacyPage": false,
    "settingsBlockUpdateSecurityPage": false,
    "settingsBlockAppsPage": false,
    "settingsBlockGamingPage": false,
    "windowsSpotlightBlockConsumerSpecificFeatures": false,
    "windowsSpotlightBlocked": true,
    "windowsSpotlightBlockOnActionCenter": false,
    "windowsSpotlightBlockTailoredExperiences": false,
    "windowsSpotlightBlockThirdPartyNotifications": false,
    "windowsSpotlightBlockWelcomeExperience": false,
    "windowsSpotlightBlockWindowsTips": false,
    "windowsSpotlightConfigureOnLockScreen": "notConfigured",
    "networkProxyApplySettingsDeviceWide": false,
    "networkProxyDisableAutoDetect": false,
    "networkProxyAutomaticConfigurationUrl": null,
    "networkProxyServer": null,
    "accountsBlockAddingNonMicrosoftAccountEmail": false,
    "antiTheftModeBlocked": false,
    "bluetoothBlocked": false,
    "cameraBlocked": false,
    "connectedDevicesServiceBlocked": false,
    "certificatesBlockManualRootCertificateInstallation": false,
    "copyPasteBlocked": false,
    "cortanaBlocked": false,
    "deviceManagementBlockFactoryResetOnMobile": false,
    "deviceManagementBlockManualUnenroll": true,
    "safeSearchFilter": "userDefined",
    "edgeBlockPopups": false,
    "edgeBlockSearchSuggestions": false,
    "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
    "edgeRequireSmartScreen": true,
    "edgeEnterpriseModeSiteListLocation": null,
    "edgeFirstRunUrl": null,
    "edgeSearchEngine": null,
    "edgeHomepageUrls": [],
    "edgeBlockAccessToAboutFlags": false,
    "smartScreenBlockPromptOverride": true,
    "smartScreenBlockPromptOverrideForFiles": false,
    "webRtcBlockLocalhostIpAddress": false,
    "internetSharingBlocked": true,
    "settingsBlockAddProvisioningPackage": false,
    "settingsBlockRemoveProvisioningPackage": false,
    "settingsBlockChangeSystemTime": false,
    "settingsBlockEditDeviceName": false,
    "settingsBlockChangeRegion": false,
    "settingsBlockChangeLanguage": false,
    "settingsBlockChangePowerSleep": false,
    "locationServicesBlocked": false,
    "microsoftAccountBlocked": false,
    "microsoftAccountBlockSettingsSync": false,
    "nfcBlocked": false,
    "resetProtectionModeBlocked": false,
    "screenCaptureBlocked": false,
    "storageBlockRemovableStorage": false,
    "storageRequireMobileDeviceEncryption": false,
    "usbBlocked": false,
    "voiceRecordingBlocked": false,
    "wiFiBlockAutomaticConnectHotspots": false,
    "wiFiBlocked": false,
    "wiFiBlockManualConfiguration": false,
    "wiFiScanInterval": null,
    "wirelessDisplayBlockProjectionToThisDevice": false,
    "wirelessDisplayBlockUserInputFromReceiver": false,
    "wirelessDisplayRequirePinForPairing": false,
    "windowsStoreBlocked": false,
    "appsAllowTrustedAppsSideloading": "notConfigured",
    "windowsStoreBlockAutoUpdate": false,
    "developerUnlockSetting": "notConfigured",
    "sharedUserAppDataAllowed": false,
    "appsBlockWindowsStoreOriginatedApps": false,
    "windowsStoreEnablePrivateStoreOnly": false,
    "storageRestrictAppDataToSystemVolume": false,
    "storageRestrictAppInstallToSystemVolume": false,
    "gameDvrBlocked": false,
    "experienceBlockDeviceDiscovery": true,
    "experienceBlockErrorDialogWhenNoSIM": false,
    "experienceBlockTaskSwitcher": false,
    "logonBlockFastUserSwitching": false
  }