
{
    "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
    "description": "Baseline configuration for the Enpoint Protection functionallity in Windows 10",
    "displayName": "Win10 - Enpoint protection - Baseline",
    "defenderSecurityCenterDisableAppBrowserUI": false,
    "defenderSecurityCenterDisableFamilyUI": false,
    "defenderSecurityCenterDisableHealthUI": false,
    "defenderSecurityCenterDisableNetworkUI": false,
    "defenderSecurityCenterDisableVirusUI": false,
    "defenderSecurityCenterOrganizationDisplayName": null,
    "defenderSecurityCenterHelpEmail": null,
    "defenderSecurityCenterHelpPhone": null,
    "defenderSecurityCenterHelpURL": null,
    "defenderSecurityCenterNotificationsFromApp": "notConfigured",
    "defenderSecurityCenterITContactDisplay": "notConfigured",
    "firewallBlockStatefulFTP": false,
    "firewallIdleTimeoutForSecurityAssociationInSeconds": null,
    "firewallPreSharedKeyEncodingMethod": "deviceDefault",
    "firewallIPSecExemptionsAllowNeighborDiscovery": false,
    "firewallIPSecExemptionsAllowICMP": false,
    "firewallIPSecExemptionsAllowRouterDiscovery": false,
    "firewallIPSecExemptionsAllowDHCP": false,
    "firewallCertificateRevocationListCheckMethod": "deviceDefault",
    "firewallMergeKeyingModuleSettings": false,
    "firewallPacketQueueingMethod": "deviceDefault",
    "firewallProfileDomain": {
        "firewallEnabled": "allowed",
        "stealthModeBlocked": false,
        "incomingTrafficBlocked": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "inboundNotificationsBlocked": false,
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "outboundConnectionsBlocked": false,
        "inboundConnectionsBlocked": false,
        "securedPacketExemptionAllowed": false,
        "policyRulesFromGroupPolicyMerged": false
    },
    "firewallProfilePublic": {
        "firewallEnabled": "allowed",
        "stealthModeBlocked": false,
        "incomingTrafficBlocked": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "inboundNotificationsBlocked": false,
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "outboundConnectionsBlocked": false,
        "inboundConnectionsBlocked": false,
        "securedPacketExemptionAllowed": false,
        "policyRulesFromGroupPolicyMerged": false
    },
    "firewallProfilePrivate": {
        "firewallEnabled": "allowed",
        "stealthModeBlocked": false,
        "incomingTrafficBlocked": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "inboundNotificationsBlocked": false,
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "outboundConnectionsBlocked": false,
        "inboundConnectionsBlocked": false,
        "securedPacketExemptionAllowed": false,
        "policyRulesFromGroupPolicyMerged": false
    },
    "defenderAttackSurfaceReductionExcludedPaths": [],
    "defenderOfficeAppsOtherProcessInjectionType": "userDefined",
    "defenderOfficeAppsExecutableContentCreationOrLaunchType": "block",
    "defenderOfficeAppsLaunchChildProcessType": "userDefined",
    "defenderOfficeMacroCodeAllowWin32ImportsType": "block",
    "defenderScriptObfuscatedMacroCodeType": "userDefined",
    "defenderScriptDownloadedPayloadExecutionType": "userDefined",
    "defenderEmailContentExecutionType": "userDefined",
    "defenderGuardMyFoldersType": "auditMode",
    "defenderGuardedFoldersAllowedAppPaths": [],
    "defenderAdditionalGuardedFolders": [],
    "defenderNetworkProtectionType": "auditMode",
    "defenderExploitProtectionXml": null,
    "defenderExploitProtectionXmlFileName": null,
    "defenderSecurityCenterBlockExploitProtectionOverride": false,
    "appLockerApplicationControl": "auditComponentsStoreAppsAndSmartlocker",
    "smartScreenEnableInShell": true,
    "smartScreenBlockOverrideForFiles": false,
    "applicationGuardEnabled": false,
    "applicationGuardBlockFileTransfer": "notConfigured",
    "applicationGuardBlockNonEnterpriseContent": false,
    "applicationGuardAllowPersistence": false,
    "applicationGuardForceAuditing": false,
    "applicationGuardBlockClipboardSharing": "notConfigured",
    "applicationGuardAllowPrintToPDF": false,
    "applicationGuardAllowPrintToXPS": false,
    "applicationGuardAllowPrintToLocalPrinters": false,
    "applicationGuardAllowPrintToNetworkPrinters": false,
    "applicationGuardAllowVirtualGPU": false,
    "bitLockerDisableWarningForOtherDiskEncryption": false,
    "bitLockerEnableStorageCardEncryptionOnMobile": false,
    "bitLockerEncryptDevice": true,
    "bitLockerSystemDrivePolicy": {
        "encryptionMethod": "xtsAes128",
        "startupAuthenticationRequired": true,
        "startupAuthenticationBlockWithoutTpmChip": true,
        "startupAuthenticationTpmUsage": "required",
        "startupAuthenticationTpmPinUsage": "allowed",
        "startupAuthenticationTpmKeyUsage": "allowed",
        "startupAuthenticationTpmPinAndKeyUsage": "allowed",
        "minimumPinLength": null,
        "recoveryOptions": {
            "blockDataRecoveryAgent": false,
            "recoveryPasswordUsage": "allowed",
            "recoveryKeyUsage": "allowed",
            "hideRecoveryOptions": false,
            "enableRecoveryInformationSaveToStore": true,
            "recoveryInformationToStore": "passwordAndKey",
            "enableBitLockerAfterRecoveryInformationToStore": true
        },
        "prebootRecoveryEnableMessageAndUrl": false,
        "prebootRecoveryMessage": null,
        "prebootRecoveryUrl": null
    },
    "bitLockerFixedDrivePolicy": {
        "encryptionMethod": "xtsAes128",
        "requireEncryptionForWriteAccess": false,
        "recoveryOptions": null
    },
    "bitLockerRemovableDrivePolicy": {
        "encryptionMethod": "aesCbc128",
        "requireEncryptionForWriteAccess": false,
        "blockCrossOrganizationWriteAccess": false
    }
  }